#인접 리스트는 '연결 리스트'라는 자료구조를 이용해 구현하는데, C++나 자바같은 프로그래밍 언어에서는 별도로 연결 리스트 기능을 위한 표준 라이브러리 제공
#파이썬은 기본 자료형인 리스트 자료형이 append()와 메소드를 제공하므로, 전통적인 프로그래밍 언어에서의 배열과 연결 리스트의 기능을 모두 기본으로 제공함
#파이썬에서 인접 리스트를 이용해 그래프를 표현하고자 할 때에는 단순히 2차원 리스트를 이용하면 된다는 점만 기억하기

#행이 3개인 2차원 리스트로 인접 리스트 표현
graph = [[] for _ in range(3)]


# 노드 0에 연결된 노드 정보 저장(노드, 거리)
graph[0].append((1, 7))
graph[0].append((2 ,5))

#노드 1에 연결된 노드 정보 저장(노드, 거리)
graph[1].append((0, 7))

#노드 2에 연결된 노드 정보 저장(노드, 거리)
graph[2].append((0,5))

print(graph)

#DFS : 스택 자료구조에 기초
